tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "symfony-cli/tap"
brew "act"
brew "bat"
brew "glib"
brew "colima", restart_service: :changed
brew "libavif"
brew "icu4c@77"
brew "php", restart_service: :changed
brew "composer"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fastfetch"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "tmux"
brew "gitmux"
brew "gnu-sed"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libgit2@1.8"
brew "openjdk"
brew "maven"
brew "mysql-client@5.7"
brew "mysql@5.7"
brew "mysql@8.0", restart_service: :changed, link: true
brew "neovim"
brew "node"
brew "opencode"
brew "php-intl"
brew "pipx"
brew "poppler"
brew "pv"
brew "python@3.12"
brew "pyvim"
brew "rabbitmq"
brew "rabbitmq-c"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "stow"
brew "tree"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "shivammathur/extensions/xdebug@8.3"
brew "symfony-cli/tap/symfony-cli"
cask "bruno"
cask "chromedriver"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "mitmproxy"
cask "visual-studio-code"
cask "wezterm"
cask "zed"
go "github.com/kisielk/errcheck"
