cask_args appdir: "~/Applications"

tap "homebrew/bundle"
tap "homebrew/services"
tap "symfony-cli/tap"

# GUI tools
cask "google-chrome"
cask "bruno"
cask "mitmproxy"
cask "warp"
cask "raycast"
cask "raindropio"
cask "font-meslo-lg-nerd-font"
cask "rectangle"
cask "jetbrains-toolbox"

# Tools
brew "composer"
brew "eza"
brew "fzf"
brew "gnu-sed"
brew "stow"
brew "symfony-cli/tap/symfony-cli"
brew "tree"
brew "zoxide"

# Dev
brew "mysql-client@5.7"
brew "mysql@5.7", restart_service: true
brew "neovim"
brew "node"
brew "php@8.1", restart_service: true
brew "redis", restart_service: true
brew "rust"
brew "yarn"

# Required for LunarVim
brew "python@3.12"
brew "pyvim"
brew "ripgrep"

