# CLI
brew "git"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "fd"
brew "lazygit"
brew "jq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Dev
brew "node"
brew "go"
brew "mysql@8.0"
brew "redis"
brew "docker"
brew "composer"
brew "shivammathur/php/php"
brew "symfony-cli"

# Shell
brew "starship"

# GUI
cask "firefox"
cask "brave-browser"
cask "raycast"
cask "ghostty"
cask "jetbrains-toolbox"
cask "heynote"
cask "hyperkey"

# Fonts
cask "font-jetbrains-mono-nerd-font"
