tap "anomalyco/tap"
tap "fluxcd/tap"
tap "shivammathur/php"
brew "bat"
brew "btop"
brew "chezmoi"
brew "colima", restart_service: :changed
brew "php", restart_service: :changed
brew "composer"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "lazysql"
brew "mysql@8.0"
brew "neovim"
brew "powerlevel10k"
brew "pv"
brew "redis"
brew "ripgrep"
brew "starship"
brew "symfony-cli"
brew "tmux"
brew "tree"
brew "yarn"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "fluxcd/tap/flux@0.41", link: true
brew "shivammathur/php/php"
cask "brave-browser"
cask "bruno"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "heynote"
cask "hyperkey"
cask "jetbrains-toolbox"
cask "mitmproxy"
cask "raycast"
cask "slack"
cask "wezterm"
go "github.com/spf13/cobra-cli"
go "gova"
go "github.com/swaggo/swag/cmd/swag"
